import React ,{Component} from 'react' 
import Card from './cardUI';
import "./card-style.css";
import G2 from '../../images/G2.jpg';
import G1 from '../../images/G1.jpg';
import G3 from '../../images/G3.jpg';

class Cards extends Component {
   
    render() {
        return (
                    <div className="container-fluid d-flex justify-content-center pb-5 ">
                          
                            <div className="row" >
                            
                            
                            <div className="col-md-4">

                                <Card imgsrc={G1}  title='החברה להגנת הטבע (ע"ר)'
                                text="החברה להגנת הטבע הוקמה בשנת 1953, על רקע המאבק נגד ייבוש אגם החולה. מאז ועד היום, מהווה שמירת הטבע, הסביבה והנוף הישראליים את עיקר פעילותנו. העובדים, אנשי החברה להגנת הטבע מקדישים את חייהם לשמירה על הסביבה והטבע הייחודי בו התברכנו. זוהי המשימה שלנו - להיות עם האצבע על הדופק בסוגיות הסביבה והטבע הבוערות בארצנו ולפעול למציאת פתרונות שיענו על צרכי האדם והטבע גם יחד."  
                                URL="https://www.teva.org.il/"/></div>


                            <div className="col-md-4">
                            
                            
                                <Card imgsrc={G2} title="רשות הטבע והגנים" text="מטרות רשות הטבע והגנים מתחלקות למחויבויות לשמור על הטבע ועל אתרי המורשת, לטפח אותם לרווחת הציבור ולחנכו בהתאם למטרות אלה.

                                רשות הטבע והגנים  היא רשות ממשלתית, גוף ציבורי המחזיק בנאמנות, בשם הציבור, חלק מנכסי הכלל: שמורות טבע וגנים לאומיים. נכסים אלו אינם שייכים רק לדור הנוכחי והרשות מחויבת אליהם כאל פיקדון עליו יש להגן לטווח הארוך, גם בעבור הדורות הבאים."   URL="https://www.parks.org.il/" 

                                /></div>
                                
                            <div className="col-md-4" >
                           
                                    <Card   meta="UTF-8"  imgsrc={G3} title="הגן הבוטני – אקולוגי" 
                                    text="
                                    הגן בטכניון משתרע על פני כ-20 דונם בתוך קריית הטכניון, בגן קיימים מערכות אקולוגיות שונות, סביבות חיים ובתי גידול. המבקר המסייר בין שבילי הגן ואזורי ההדגמה שלו פוגש תופעות טבע ונחשף לרעיונות סביבתיים ומדעיים.
                                    תפקידי הגן: מפגש בין האדם לטבע, הדגמה של תועלת הרמונית של האדם והטבע, הנגשה של האקולוגיה, מקום בילוי לסטודנטים, נופש ומנוחה מהלימודים.  ערך חינוכי לימודי. חיבור לטבע.                                    "  
                                    URL="https://ecogarden.technion.ac.il/"
                                    text2="walaa"
                                    
                                    /></div>

                            </div>


                    </div>    

        );
    }
}

export default Cards;